RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_romapi.c
#include "bl702_romdriver.h"

/******************************************************************************/
__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    AON_Power_On_MBG(void)
{
    return RomDriver_AON_Power_On_MBG();
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    AON_Power_Off_MBG(void)
{
    return RomDriver_AON_Power_Off_MBG();
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    AON_Power_On_XTAL(void)
{
    return RomDriver_AON_Power_On_XTAL();
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    AON_Set_Xtal_CapCode(uint8_t capIn, uint8_t capOut)
{
    return RomDriver_AON_Set_Xtal_CapCode(capIn, capOut);
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    AON_Power_Off_XTAL(void)
{
    return RomDriver_AON_Power_Off_XTAL();
}
/******************************************************************************/

/******************************************************************************/
__ALWAYS_INLINE ATTR_TCM_SECTION void ASM_Delay_Us(uint32_t core, uint32_t cnt)
{
    RomDriver_ASM_Delay_Us(core, cnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void BL702_Delay_US(uint32_t cnt)
{
    RomDriver_BL702_Delay_US(cnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void BL702_Delay_MS(uint32_t cnt)
{
    RomDriver_BL702_Delay_MS(cnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void *BL702_MemCpy(void *dst, const void *src, uint32_t n)
{
    return RomDriver_BL702_MemCpy(dst, src, n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    uint32_t *
    BL702_MemCpy4(uint32_t *dst, const uint32_t *src, uint32_t n)
{
    return RomDriver_BL702_MemCpy4(dst, src, n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void* BL702_MemCpy_Fast(void *pdst, const void *psrc, uint32_t n) {
    return RomDriver_BL702_MemCpy_Fast(pdst, psrc, n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void *ARCH_MemCpy_Fast(void *pdst, const void *psrc, uint32_t n)
{
    return RomDriver_ARCH_MemCpy_Fast(pdst, psrc, n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void *BL702_MemSet(void *s, uint8_t c, uint32_t n)
{
    return RomDriver_BL702_MemSet(s, c, n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    uint32_t *
    BL702_MemSet4(uint32_t *dst, const uint32_t val, uint32_t n)
{
    return RomDriver_BL702_MemSet4(dst, val, n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION int BL702_MemCmp(const void *s1, const void *s2, uint32_t n)
{
    return RomDriver_BL702_MemCmp(s1, s2, n);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    uint32_t
    BFLB_Soft_CRC32(void *dataIn, uint32_t len)
{
    return RomDriver_BFLB_Soft_CRC32(dataIn, len);
}
/******************************************************************************/

/******************************************************************************/
__ALWAYS_INLINE ATTR_CLOCK_SECTION
    GLB_ROOT_CLK_Type
    GLB_Get_Root_CLK_Sel(void)
{
    return RomDriver_GLB_Get_Root_CLK_Sel();
}
#if 0
__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    GLB_Set_System_CLK_Div(uint8_t hclkDiv, uint8_t bclkDiv)
{
    return RomDriver_GLB_Set_System_CLK_Div(hclkDiv, bclkDiv);
}
#endif
__ALWAYS_INLINE ATTR_CLOCK_SECTION
    uint8_t
    GLB_Get_BCLK_Div(void)
{
    return RomDriver_GLB_Get_BCLK_Div();
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    uint8_t
    GLB_Get_HCLK_Div(void)
{
    return RomDriver_GLB_Get_HCLK_Div();
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    Update_SystemCoreClockWith_XTAL(GLB_DLL_XTAL_Type xtalType)
{
    return RomDriver_Update_SystemCoreClockWith_XTAL(xtalType);
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    GLB_Set_System_CLK(GLB_DLL_XTAL_Type xtalType, GLB_SYS_CLK_Type clkFreq)
{
    return RomDriver_GLB_Set_System_CLK(xtalType, clkFreq);
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    System_Core_Clock_Update_From_RC32M(void)
{
    return RomDriver_System_Core_Clock_Update_From_RC32M();
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    GLB_Set_SF_CLK(uint8_t enable, GLB_SFLASH_CLK_Type clkSel, uint8_t div)
{
    return RomDriver_GLB_Set_SF_CLK(enable, clkSel, div);
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    GLB_Power_Off_DLL(void)
{
    return RomDriver_GLB_Power_Off_DLL();
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    GLB_Power_On_DLL(GLB_DLL_XTAL_Type xtalType)
{
    return RomDriver_GLB_Power_On_DLL(xtalType);
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    GLB_Enable_DLL_All_Clks(void)
{
    return RomDriver_GLB_Enable_DLL_All_Clks();
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    GLB_Enable_DLL_Clk(GLB_DLL_CLK_Type dllClk)
{
    return RomDriver_GLB_Enable_DLL_Clk(dllClk);
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    GLB_Disable_DLL_All_Clks(void)
{
    return RomDriver_GLB_Disable_DLL_All_Clks();
}

__ALWAYS_INLINE ATTR_CLOCK_SECTION
    BL_Err_Type
    GLB_Disable_DLL_Clk(GLB_DLL_CLK_Type dllClk)
{
    return RomDriver_GLB_Disable_DLL_Clk(dllClk);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    GLB_SW_System_Reset(void)
{
    return RomDriver_GLB_SW_System_Reset();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    GLB_SW_CPU_Reset(void)
{
    return RomDriver_GLB_SW_CPU_Reset();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    GLB_SW_POR_Reset(void)
{
    return RomDriver_GLB_SW_POR_Reset();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    GLB_Select_Internal_Flash(void)
{
    return RomDriver_GLB_Select_Internal_Flash();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    GLB_Swap_Flash_Pin(void)
{
    return RomDriver_GLB_Swap_Flash_Pin();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    GLB_Swap_Flash_CS_IO2_Pin(void)
{
    return RomDriver_GLB_Swap_Flash_CS_IO2_Pin();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    GLB_Swap_Flash_IO0_IO3_Pin(void)
{
    return RomDriver_GLB_Swap_Flash_IO0_IO3_Pin();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    GLB_Select_Internal_PSram(void)
{
    return RomDriver_GLB_Select_Internal_PSram();
}

/* aon pads GPIO9~GPIO13 IE controlled by HBN reg_aon_pad_ie_smt, abandon romdriver for this reason */
#if 0
__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type GLB_GPIO_Init(GLB_GPIO_Cfg_Type *cfg)
{
    return RomDriver_GLB_GPIO_Init(cfg);
}
#endif

