RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_romapi.c
__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_xip_sflash_erase_need_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t startaddr, int len, uint8_t group, uint8_t bank)
{
    uint8_t io_mode = p_flash_cfg->io_mode & 0xf;
    return RomDriver_XIP_SFlash_Erase_Need_Lock(p_flash_cfg, io_mode, startaddr, startaddr+len-1);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_xip_sflash_write_need_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t addr, uint8_t *data, uint32_t len, uint8_t group, uint8_t bank)
{
    uint8_t io_mode = p_flash_cfg->io_mode & 0xf;
    return RomDriver_XIP_SFlash_Write_Need_Lock(p_flash_cfg, io_mode, addr, data, len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_xip_sflash_read_need_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t addr, uint8_t *data, uint32_t len, uint8_t group, uint8_t bank)
{
    uint8_t io_mode = p_flash_cfg->io_mode & 0xf;
    return RomDriver_XIP_SFlash_Read_Need_Lock(p_flash_cfg, io_mode, addr, data, len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_xip_sflash_get_jedecid_need_lock(spi_flash_cfg_type *p_flash_cfg, uint8_t *data, uint8_t group, uint8_t bank)
{
    uint8_t io_mode = p_flash_cfg->io_mode & 0xf;
    return RomDriver_XIP_SFlash_GetJedecId_Need_Lock(p_flash_cfg, io_mode, data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_xip_sflash_get_deviceid_need_lock(spi_flash_cfg_type *p_flash_cfg, uint8_t is_32bits_addr, uint8_t *data, uint8_t group, uint8_t bank)
{
    uint8_t io_mode = p_flash_cfg->io_mode & 0xf;
    return RomDriver_XIP_SFlash_GetDeviceId_Need_Lock(p_flash_cfg, io_mode, data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_xip_sflash_get_uniqueid_need_lock(spi_flash_cfg_type *p_flash_cfg, uint8_t *data, uint8_t id_len, uint8_t group, uint8_t bank)
{
    uint8_t io_mode = p_flash_cfg->io_mode & 0xf;
    return RomDriver_XIP_SFlash_GetUniqueId_Need_Lock(p_flash_cfg, io_mode, data, id_len);
}

#if 0
__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_xip_sflash_read_via_cache_need_lock(uint32_t addr, uint8_t *data, uint32_t len, uint8_t group, uint8_t bank)
{
    uint8_t io_mode = p_flash_cfg->io_mode & 0xf;
    return RomDriver_XIP_SFlash_Read_Via_Cache_Need_Lock(addr, data, len);
}
#endif

__ALWAYS_INLINE ATTR_TCM_SECTION int bflb_xip_sflash_read_with_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t addr, uint8_t *dst, int len, uint8_t group, uint8_t bank)
{
    uint8_t io_mode = p_flash_cfg->io_mode & 0xf;
    return RomDriver_XIP_SFlash_Read_With_Lock(p_flash_cfg, io_mode, addr, dst, len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION int bflb_xip_sflash_write_with_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t addr, uint8_t *src, int len, uint8_t group, uint8_t bank)
{
    uint8_t io_mode = p_flash_cfg->io_mode & 0xf;
    return RomDriver_XIP_SFlash_Write_With_Lock(p_flash_cfg, io_mode, addr, src, len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION int bflb_xip_sflash_erase_with_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t addr, int len, uint8_t group, uint8_t bank)
{
    uint8_t io_mode = p_flash_cfg->io_mode & 0xf;
    return RomDriver_XIP_SFlash_Erase_With_Lock(p_flash_cfg, io_mode, addr, len);
}
/******************************************************************************/

/******************************************************************************/
__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_init(const struct sf_ctrl_cfg_type *p_sf_ctrl_cfg)
{
    RomDriver_SFlash_Init(p_sf_ctrl_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION int bflb_sflash_setspimode(uint8_t mode)
{
    return RomDriver_SFlash_SetSPIMode(mode);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_read_reg(spi_flash_cfg_type *flash_cfg, uint8_t reg_index, uint8_t *reg_value, uint8_t reg_len)
{
    return RomDriver_SFlash_Read_Reg(flash_cfg, reg_index, reg_value, reg_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_write_reg(spi_flash_cfg_type *flash_cfg, uint8_t reg_index, uint8_t *reg_value, uint8_t reg_len)
{
    return RomDriver_SFlash_Write_Reg(flash_cfg, reg_index, reg_value, reg_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_read_reg_with_cmd(spi_flash_cfg_type *flash_cfg, uint8_t readRegCmd, uint8_t *reg_value, uint8_t reg_len)
{
    return RomDriver_SFlash_Read_Reg_With_Cmd(flash_cfg, readRegCmd, reg_value, reg_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_write_reg_with_cmd(spi_flash_cfg_type *flash_cfg, uint8_t writeRegCmd, uint8_t *reg_value, uint8_t reg_len)
{
    return RomDriver_SFlash_Write_Reg_With_Cmd(flash_cfg, writeRegCmd, reg_value, reg_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_busy(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Busy(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_write_enable(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Write_Enable(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_qspi_enable(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Qspi_Enable(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_volatile_reg_write_enable(spi_flash_cfg_type *flash_cfg)
{
    RomDriver_SFlash_Volatile_Reg_Write_Enable(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_chip_erase(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Chip_Erase(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_sector_erase(spi_flash_cfg_type *flash_cfg, uint32_t secNum)
{
    return RomDriver_SFlash_Sector_Erase(flash_cfg, secNum);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_blk32_erase(spi_flash_cfg_type *flash_cfg, uint32_t blkNum)
{
    return RomDriver_SFlash_Blk32_Erase(flash_cfg, blkNum);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_blk64_erase(spi_flash_cfg_type *flash_cfg, uint32_t blkNum)
{
    return RomDriver_SFlash_Blk64_Erase(flash_cfg, blkNum);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_erase(spi_flash_cfg_type *flash_cfg, uint32_t startaddr, uint32_t endaddr)
{
    return RomDriver_SFlash_Erase(flash_cfg, startaddr, endaddr);
}

