RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_romapi.c
__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_program(spi_flash_cfg_type *flash_cfg, uint8_t io_mode, uint32_t addr, uint8_t *data, uint32_t len)
{
    return RomDriver_SFlash_Program(flash_cfg, io_mode, addr, data, len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_get_uniqueid(uint8_t *data, uint8_t id_len)
{
    RomDriver_SFlash_GetUniqueId(data, id_len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_get_jedecid(spi_flash_cfg_type *flash_cfg, uint8_t *data)
{
    RomDriver_SFlash_GetJedecId(flash_cfg, data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_get_deviceid(uint8_t *data, uint8_t is_32bits_addr)
{
    RomDriver_SFlash_GetDeviceId(data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_powerdown(void)
{
    RomDriver_SFlash_Powerdown();
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_release_powerdown(spi_flash_cfg_type *flash_cfg)
{
    RomDriver_SFlash_Releae_Powerdown(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_restore_from_powerdown(spi_flash_cfg_type *p_flash_cfg, uint8_t flash_cont_read, uint8_t bank)
{
    return RomDriver_SFlash_Restore_From_Powerdown(p_flash_cfg, flash_cont_read);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_set_burst_wrap(spi_flash_cfg_type *flash_cfg)
{
    RomDriver_SFlash_SetBurstWrap(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_disable_burst_wrap(spi_flash_cfg_type *flash_cfg)
{
    RomDriver_SFlash_DisableBurstWrap(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_software_reset(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Software_Reset(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_reset_continue_read(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Reset_Continue_Read(flash_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_set_idbus_cfg(spi_flash_cfg_type *flash_cfg,
                              uint8_t io_mode, uint8_t contRead, uint32_t addr, uint32_t len, uint8_t bank)
{
    return RomDriver_SFlash_Set_IDbus_Cfg(flash_cfg, io_mode, contRead, addr, len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_idbus_read_enable(spi_flash_cfg_type *flash_cfg, uint8_t io_mode, uint8_t contRead, uint8_t bank)
{
    return RomDriver_SFlash_IDbus_Read_Enable(flash_cfg, io_mode, contRead);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_cache_read_enable(spi_flash_cfg_type *flash_cfg,
                             uint8_t io_mode, uint8_t contRead, uint8_t wayDisable)
{
    return RomDriver_SFlash_Cache_Read_Enable(flash_cfg, io_mode, contRead, wayDisable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sflash_cache_read_disable(void)
{
    RomDriver_SFlash_Cache_Read_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sflash_read(spi_flash_cfg_type *flash_cfg,
                uint8_t io_mode, uint8_t contRead, uint32_t addr, uint8_t *data, uint32_t len)
{
    return RomDriver_SFlash_Read(flash_cfg, io_mode, contRead, addr, data, len);
}
/******************************************************************************/

/******************************************************************************/
__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    L1C_Cache_Enable_Set(uint8_t wayDisable)
{
    return RomDriver_L1C_Cache_Enable_Set(wayDisable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_l1c_cache_write_set(uint8_t wt_en, uint8_t wb_en, uint8_t wa_en)
{
    RomDriver_L1C_Cache_Write_Set(wt_en, wb_en, wa_en);
}

#if 0
__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    L1C_Cache_Flush(uint8_t wayDisable)
{
    return RomDriver_L1C_Cache_Flush(wayDisable);
}
#endif

__ALWAYS_INLINE ATTR_TCM_SECTION void L1C_Cache_Hit_Count_Get(uint32_t *hitCountLow, uint32_t *hitCountHigh)
{
    RomDriver_L1C_Cache_Hit_Count_Get(hitCountLow, hitCountHigh);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    uint32_t
    L1C_Cache_Miss_Count_Get(void)
{
    return RomDriver_L1C_Cache_Miss_Count_Get();
}

__ALWAYS_INLINE ATTR_TCM_SECTION void L1C_Cache_Read_Disable(void)
{
    RomDriver_L1C_Cache_Read_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    L1C_Set_Wrap(BL_Fun_Type wrap)
{
    return RomDriver_L1C_Set_Wrap(wrap);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    L1C_Set_Way_Disable(uint8_t disableVal)
{
    return RomDriver_L1C_Set_Way_Disable(disableVal);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    BL_Err_Type
    L1C_IROM_2T_Access_Set(uint8_t enable)
{
    return RomDriver_L1C_IROM_2T_Access_Set(enable);
}
/******************************************************************************/

/******************************************************************************/
__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_enable(const struct sf_ctrl_cfg_type *cfg)
{
    RomDriver_SF_Ctrl_Enable(cfg);
}

#if 0
__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_ctrl_psram_init(struct sf_ctrl_psram_cfg *psram_cfg)
{
    RomDriver_SF_Ctrl_Psram_Init(psram_cfg);
}
#endif

__ALWAYS_INLINE ATTR_TCM_SECTION
    uint8_t
    bflb_sf_ctrl_get_clock_delay(void)
{
    return RomDriver_SF_Ctrl_Get_Clock_Delay();
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_set_clock_delay(uint8_t delay)
{
    RomDriver_SF_Ctrl_Set_Clock_Delay(delay);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_cmds_set(struct sf_ctrl_cmds_cfg *cmds_cfg, uint8_t sel)
{
    RomDriver_SF_Ctrl_Cmds_Set(cmds_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_set_owner(uint8_t owner)
{
    RomDriver_SF_Ctrl_Set_Owner(owner);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_disable(void)
{
    RomDriver_SF_Ctrl_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_select_pad(uint8_t sel)
{
    RomDriver_SF_Ctrl_Select_Pad(sel);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_select_bank(uint8_t sel)
{
    RomDriver_SF_Ctrl_Select_Bank(sel);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_aes_enable_be(void)
{
    RomDriver_SF_Ctrl_AES_Enable_BE();
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_aes_enable_le(void)
{
    RomDriver_SF_Ctrl_AES_Enable_LE();
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_aes_set_region(uint8_t region, uint8_t enable,
                                                             uint8_t hw_key, uint32_t start_addr, uint32_t end_addr, uint8_t locked)
{
    RomDriver_SF_Ctrl_AES_Set_Region(region, enable, hw_key, start_addr, end_addr, locked);
}

