RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_romapi.c
__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_aes_set_key(uint8_t region, uint8_t *key, uint8_t key_type)
{
    RomDriver_SF_Ctrl_AES_Set_Key(region, key, key_type);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_aes_set_key_be(uint8_t region, uint8_t *key, uint8_t key_type)
{
    RomDriver_SF_Ctrl_AES_Set_Key_BE(region, key, key_type);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_aes_set_iv(uint8_t region, uint8_t *iv, uint32_t addr_offset)
{
    RomDriver_SF_Ctrl_AES_Set_IV(region, iv, addr_offset);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_aes_set_iv_be(uint8_t region, uint8_t *iv, uint32_t addr_offset)
{
    RomDriver_SF_Ctrl_AES_Set_IV_BE(region, iv, addr_offset);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_aes_enable(void)
{
    RomDriver_SF_Ctrl_AES_Enable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_aes_disable(void)
{
    RomDriver_SF_Ctrl_AES_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    uint8_t
    bflb_sf_ctrl_is_aes_enable(void)
{
    return RomDriver_SF_Ctrl_Is_AES_Enable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_set_flash_image_offset(uint32_t addr_offset, uint8_t group, uint8_t bank)
{
    RomDriver_SF_Ctrl_Set_Flash_Image_Offset(addr_offset);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    uint32_t
    bflb_sf_ctrl_get_flash_image_offset(uint8_t group, uint8_t bank)
{
    return RomDriver_SF_Ctrl_Get_Flash_Image_Offset();
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_select_clock(uint8_t sahb_type)
{
    RomDriver_SF_Ctrl_Select_Clock(sahb_type);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_sendcmd(struct sf_ctrl_cmd_cfg_type *cfg)
{
    RomDriver_SF_Ctrl_SendCmd(cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_flash_read_icache_set(struct sf_ctrl_cmd_cfg_type *cfg, uint8_t cmd_valid)
{
    RomDriver_SF_Ctrl_Flash_Read_Icache_Set(cfg, cmd_valid);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_psram_write_icache_set(struct sf_ctrl_cmd_cfg_type *cfg, uint8_t cmd_valid)
{
    RomDriver_SF_Ctrl_Psram_Write_Icache_Set(cfg, cmd_valid);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_ctrl_psram_read_icache_set(struct sf_ctrl_cmd_cfg_type *cfg, uint8_t cmd_valid)
{
    RomDriver_SF_Ctrl_Psram_Read_Icache_Set(cfg, cmd_valid);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    uint8_t
    bflb_sf_ctrl_get_busy_state(void)
{
    return RomDriver_SF_Ctrl_GetBusyState();
}

__ALWAYS_INLINE ATTR_TCM_SECTION int bflb_sf_cfg_deinit_ext_flash_gpio(uint8_t ext_flash_pin)
{
    return RomDriver_SF_Cfg_Deinit_Ext_Flash_Gpio(ext_flash_pin);
}

#if 0
__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_sf_cfg_init_ext_flash_gpio(uint8_t ext_flash_pin)
{
    RomDriver_SF_Cfg_Init_Ext_Flash_Gpio(ext_flash_pin);
}
#endif

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_sf_cfg_get_flash_cfg_need_lock(uint32_t flash_id, spi_flash_cfg_type *p_flash_cfg, uint8_t group, uint8_t bank)
{
    return RomDriver_SF_Cfg_Get_Flash_Cfg_Need_Lock(flash_id, p_flash_cfg);
}

#if 0
__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_sf_cfg_init_flash_gpio(uint8_t flash_pin_cfg, uint8_t restore_default)
{
    RomDriver_SF_Cfg_Init_Flash_Gpio(flash_pin_cfg, restore_default);
}
#endif

__ALWAYS_INLINE ATTR_TCM_SECTION
    uint32_t
    bflb_sf_cfg_flash_identify(uint8_t callFromFlash, uint8_t flash_pin_cfg, uint8_t restore_default,
                          spi_flash_cfg_type *p_flash_cfg, uint8_t group, uint8_t bank)
{
    uint8_t auto_scan = 0;
    uint8_t flash_pin = 0;
    auto_scan = ((flash_pin_cfg >> 7) & 1);
    flash_pin = (flash_pin_cfg & 0x7F);
    return RomDriver_SF_Cfg_Flash_Identify(callFromFlash, auto_scan, flash_pin, restore_default, p_flash_cfg);
}
/******************************************************************************/

/******************************************************************************/
#if 0
__ALWAYS_INLINE ATTR_TCM_SECTION
void bflb_psram_init(struct spi_psram_cfg_type *psram_cfg, struct sf_ctrl_cmds_cfg *cmds_cfg, struct sf_ctrl_psram_cfg *psram_cfg)
{
    RomDriver_Psram_Init(psram_cfg, cmds_cfg, psram_cfg);
}
#endif

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_psram_readreg(struct spi_psram_cfg_type *psram_cfg, uint8_t *reg_value)
{
    RomDriver_Psram_ReadReg(psram_cfg, reg_value);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_psram_writereg(struct spi_psram_cfg_type *psram_cfg, uint8_t *reg_value)
{
    RomDriver_Psram_WriteReg(psram_cfg, reg_value);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_psram_setdrivestrength(struct spi_psram_cfg_type *psram_cfg)
{
    return RomDriver_Psram_SetDriveStrength(psram_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_psram_setburstwrap(struct spi_psram_cfg_type *psram_cfg)
{
    return RomDriver_Psram_SetBurstWrap(psram_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION void bflb_psram_readid(struct spi_psram_cfg_type *psram_cfg, uint8_t *data)
{
    RomDriver_Psram_ReadId(psram_cfg, data);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_psram_enterquadmode(struct spi_psram_cfg_type *psram_cfg)
{
    return RomDriver_Psram_EnterQuadMode(psram_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_psram_exitquadmode(struct spi_psram_cfg_type *psram_cfg)
{
    return RomDriver_Psram_ExitQuadMode(psram_cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_psram_toggleburstlength(struct spi_psram_cfg_type *psram_cfg, uint8_t ctrl_mode)
{
    return RomDriver_Psram_ToggleBurstLength(psram_cfg, ctrl_mode);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_psram_softwarereset(struct spi_psram_cfg_type *psram_cfg, uint8_t ctrl_mode)
{
    return RomDriver_Psram_SoftwareReset(psram_cfg, ctrl_mode);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_psram_set_idbus_cfg(struct spi_psram_cfg_type *psram_cfg,
                        uint8_t io_mode, uint32_t addr, uint32_t len)
{
    return RomDriver_Psram_Set_IDbus_Cfg(psram_cfg, io_mode, addr, len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_psram_cache_write_set(struct spi_psram_cfg_type *psram_cfg, uint8_t io_mode,
                               uint8_t wt_en, uint8_t wb_en, uint8_t wa_en)
{
    return RomDriver_Psram_Cache_Write_Set(psram_cfg, io_mode, wt_en, wb_en, wa_en);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_psram_write(struct spi_psram_cfg_type *psram_cfg,
                uint8_t io_mode, uint32_t addr, uint8_t *data, uint32_t len)
{
    return RomDriver_Psram_Write(psram_cfg, io_mode, addr, data, len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
    int
    bflb_psram_read(struct spi_psram_cfg_type *psram_cfg,
               uint8_t io_mode, uint32_t addr, uint8_t *data, uint32_t len)
{
    return RomDriver_Psram_Read(psram_cfg, io_mode, addr, data, len);
}
/******************************************************************************/
